sabre_docs/VerifyFlightDetailsLLS2.0.1RQ/VerifyFlightDetailsLLS2.0.1RQ.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:sws_xsd="http://webservices.sabre.com/sabreXML/2011/10" xmlns:sws="https://webservices.sabre.com/websvc" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" targetNamespace="https://webservices.sabre.com/websvc">
	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://webservices.sabre.com/sabreXML/2011/10" schemaLocation="VerifyFlightDetailsLLS2.0.1RQRS.xsd"/>
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="msg-header-2_0.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="wsse.xsd"/>
			<xsd:import namespace="http://services.sabre.com/STL/v01" schemaLocation="STL_For_SabreProtocol_v.1.2.0.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="VerifyFlightDetailsInput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<wsdl:part name="body" element="sws_xsd:VerifyFlightDetailsRQ"/>
	</wsdl:message>
	<wsdl:message name="VerifyFlightDetailsOutput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<wsdl:part name="body" element="sws_xsd:VerifyFlightDetailsRS"/>
	</wsdl:message>
	<wsdl:portType name="VerifyFlightDetailsPortType">
		<wsdl:operation name="VerifyFlightDetailsRQ">
			<wsdl:input message="sws:VerifyFlightDetailsInput"/>
			<wsdl:output message="sws:VerifyFlightDetailsOutput"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="VerifyFlightDetailsSoapBinding" type="sws:VerifyFlightDetailsPortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="VerifyFlightDetailsRQ">
			<soap:operation soapAction="VerifyFlightDetailsLLSRQ"/>
			<wsdl:input>
				<soap:header message="sws:VerifyFlightDetailsInput" part="header" use="literal"/>
				<soap:header message="sws:VerifyFlightDetailsInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:header message="sws:VerifyFlightDetailsOutput" part="header" use="literal"/>
				<soap:header message="sws:VerifyFlightDetailsOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="VerifyFlightDetailsService">
		<wsdl:port name="VerifyFlightDetailsPortType" binding="sws:VerifyFlightDetailsSoapBinding">
			<soap:address location="https://webservices.platform.sabre.com/websvc"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
